XMLFile2.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <preparePlan xmlns="http://api">
      <routePoints>
        <hide xmlns="http://pojo.api">false</hide>
        <periodid xmlns="http://pojo.api">715</periodid>
        <point_Coordinates xmlns="http://pojo.api">120;140</point_Coordinates>
        <point_Name xsi:nil="true" xmlns="http://pojo.api"/>
        <point_Orientation xmlns="http://pojo.api">90</point_Orientation>
        <point_Speed xmlns="http://pojo.api">0</point_Speed>
        <pointid xmlns="http://pojo.api">15</pointid>
        <preferred_Order xmlns="http://pojo.api">1</preferred_Order>
        <req_id xmlns="http://pojo.api">1</req_id>
        <time xmlns="http://pojo.api">08:11:40</time>
        <user_Message xsi:nil="true" xmlns="http://pojo.api"/>
        <weekday xmlns="http://pojo.api">Sat</weekday>
      </routePoints>
      <routePoints>
        <hide xmlns="http://pojo.api">false</hide>
        <periodid xmlns="http://pojo.api">716</periodid>
        <point_Coordinates xmlns="http://pojo.api">120;150</point_Coordinates>
        <point_Name xsi:nil="true" xmlns="http://pojo.api"/>
        <point_Orientation xmlns="http://pojo.api">90</point_Orientation>
        <point_Speed xmlns="http://pojo.api">0</point_Speed>
        <pointid xmlns="http://pojo.api">19</pointid>
        <preferred_Order xmlns="http://pojo.api">3</preferred_Order>
        <req_id xmlns="http://pojo.api">2</req_id>
        <time xmlns="http://pojo.api">08:11:40</time>
        <user_Message xsi:nil="true" xmlns="http://pojo.api"/>
        <weekday xmlns="http://pojo.api">Sat</weekday>
      </routePoints>
      <routePoints>
        <hide xmlns="http://pojo.api">false</hide>
        <periodid xmlns="http://pojo.api">717</periodid>
        <point_Coordinates xmlns="http://pojo.api">120;160</point_Coordinates>
        <point_Name xsi:nil="true" xmlns="http://pojo.api"/>
        <point_Orientation xmlns="http://pojo.api">90</point_Orientation>
        <point_Speed xmlns="http://pojo.api">0</point_Speed>
        <pointid xmlns="http://pojo.api">20</pointid>
        <preferred_Order xmlns="http://pojo.api">4</preferred_Order>
        <req_id xmlns="http://pojo.api">3</req_id>
        <time xmlns="http://pojo.api">08:11:40</time>
        <user_Message xsi:nil="true" xmlns="http://pojo.api"/>
        <weekday xmlns="http://pojo.api">Sat</weekday>
      </routePoints>
      <routePoints>
        <hide xmlns="http://pojo.api">false</hide>
        <periodid xmlns="http://pojo.api">718</periodid>
        <point_Coordinates xmlns="http://pojo.api">120;170</point_Coordinates>
        <point_Name xsi:nil="true" xmlns="http://pojo.api"/>
        <point_Orientation xmlns="http://pojo.api">90</point_Orientation>
        <point_Speed xmlns="http://pojo.api">0</point_Speed>
        <pointid xmlns="http://pojo.api">23</pointid>
        <preferred_Order xmlns="http://pojo.api">5</preferred_Order>
        <req_id xmlns="http://pojo.api">4</req_id>
        <time xmlns="http://pojo.api">08:11:40</time>
        <user_Message xsi:nil="true" xmlns="http://pojo.api"/>
        <weekday xmlns="http://pojo.api">Sat</weekday>
      </routePoints>
      <routePoints>
        <hide xmlns="http://pojo.api">false</hide>
        <periodid xmlns="http://pojo.api">719</periodid>
        <point_Coordinates xmlns="http://pojo.api">120;180</point_Coordinates>
        <point_Name xsi:nil="true" xmlns="http://pojo.api"/>
        <point_Orientation xmlns="http://pojo.api">90</point_Orientation>
        <point_Speed xmlns="http://pojo.api">0</point_Speed>
        <pointid xmlns="http://pojo.api">16</pointid>
        <preferred_Order xmlns="http://pojo.api">6</preferred_Order>
        <req_id xmlns="http://pojo.api">5</req_id>
        <time xmlns="http://pojo.api">08:11:40</time>
        <user_Message xsi:nil="true" xmlns="http://pojo.api"/>
        <weekday xmlns="http://pojo.api">Sat</weekday>
      </routePoints>
    </preparePlan>
  </s:Body>
</s:Envelope>